src/ExtendedBehaviorTrees.org
#+TITLE: Extended Behavior Trees
#+AUTHOR: Matthias Hölzl
#+EMAIL: tc@xantira.com
#+LATEX_CLASS: article
#+LATEX_CLASS_OPTIONS: [a4wide]
#+LATEX_HEADER: \usepackage{a4wide}
#+LATEX_HEADER: \parindent 0pt
#+LATEX_HEADER: \parskip 0.5ex
#+PROPERTY: header-args       :results silent
#+PROPERTY: header-args:julia :session *julia* 
#+PROPERTY: tangle             yes
#+DRAWERS:  HIDDEN

* About this document
  
  The source of this document is an Org-Mode file that contains text,
  Julia source code and some additional data such as spreadsheets or
  tables with the results of experiments.  This file is completely
  self-contained, so that it is straightforward to recreate the
  results of the experiments once you have set up the required
  environment.  To recompile the code in this document and re-run the
  experiments you need to install Julia 0.4 as well as Emacs with
  Org-Mode and ESS (Emacs Speaks Statistics).  If you lack parts of
  this setup you will still be able to read the pre-generated output
  (in TeX and HTML format), and you can run the extracted Julia code
  on data you provide to a stand-alone Julia implementation, but it
  will be more difficult to recreate the results.

  To evaluate all code in this file evaluate
  ~org-babel-execute-buffer~ in Emacs (i.e., open the file in an
  instance of Emacs in which the prerequisites mentioned in the
  previous paragraph are installed, and enter ~M-x
  org-babel-execute-buffer~).  Wait a while, and the results in the
  buffer will be updated with the results of executing the examples on
  your machine.

  We add a warning (not shown in the typeset output) at the beginning
  of the generated file ~ExtendedBehaviorTrees.jl~, so that people
  don't accidentally edit the generated source.

  #+BEGIN_SRC julia :eval never :exports none
    # GENERATED FROM ExtendedBehaviorTrees.org.
    # DO NOT EDIT THIS FILE!

    # Copyright © 2014, Matthias Hölzl
    # Licensed under the MIT license, see the file LICENSE.md.
  #+END_SRC


  The whole file is in the ~ExtendedBehaviorTrees~ module; the ~end~
  for this module declaration is at the end of the file.  We disable
  evaluation of the module statement inside Org-Mode since it causes
  the Julia process to hang.  (Module disabled for now to simplify
  reloading the code during development.)

  #+BEGIN_SRC julia :eval never
    module ExtendedBehaviorTrees
  #+END_SRC
      


* Behavior Trees and Extended Behavior Trees

  Behavior Trees (BTs) are a flexible approach for behavioral
  modeling.  BTs were originally introduced to model the AI of
  computer games, and they have recently been become more popular in
  areas such as robotics or avionics.  BTs compose atomic behaviors
  (that should correspond to more or less simple actions an agent can
  take) using operations such as sequence (execute multiple behaviors
  one after the other) or choice (pick among behaviors until one
  succeeds).  We sometimes call behaviors /actions/ or /tasks/.  One
  of the advantages of BTs is that the interface between a task and
  its subtasks is very simple:

  - Each task can be started; once started it runs until it returns
    control to its parent.  Because of the root in game engines, this
    behavior is often called /ticking/, and the corresponding function
    is ~tick~.  Scheduling is cooperative; behaviors have to return
    after taking a small amount of time if the BT is integrated into a
    frequently executing control loop.

  - A behavior can return one of three status indications: it
    succeeded, it failed, or it is still running.  This last status
    allows BTs to integrate long-running behaviors in an event loop.

