src/ExtendedBehaviorTrees.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Extended Behavior Trees</title>
<!-- 2014-12-04 Thu 14:21 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Matthias Hölzl" />
</head>
<body>
<div id="content">
<h1 class="title">Extended Behavior Trees</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. About this document</a></li>
<li><a href="#sec-2">2. Behavior Trees and Extended Behavior Trees</a>
<ul>
<li><a href="#sec-2-1">2.1. Extended Behavior Trees</a></li>
<li><a href="#sec-2-2">2.2. Notes about the implementation</a></li>
</ul>
</li>
<li><a href="#sec-3">3. Implementation of the basic function</a>
<ul>
<li><a href="#sec-3-1">3.1. Execution status of nodes</a></li>
<li><a href="#sec-3-2">3.2. Results of ticking nodes</a></li>
<li><a href="#sec-3-3">3.3. XBT Nodes</a></li>
<li><a href="#sec-3-4">3.4. Atomic XBT Nodes</a></li>
<li><a href="#sec-3-5">3.5. Composite XBT Nodes</a>
<ul>
<li><a href="#sec-3-5-1">3.5.1. Sequence nodes</a></li>
<li><a href="#sec-3-5-2">3.5.2. Choice nodes</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#sec-4">4. HTN Planning</a>
<ul>
<li><a href="#sec-4-1">4.1. States and Goals</a></li>
<li><a href="#sec-4-2">4.2. The Planner</a></li>
</ul>
</li>
<li><a href="#sec-5">5. Reinforcement Learning</a></li>
</ul>
</div>
</div>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> About this document</h2>
<div class="outline-text-2" id="text-1">
<p>
The source of this document is an Org-Mode file that contains text,
Julia source code and some additional data such as spreadsheets or
tables with the results of experiments.  This file is completely
self-contained, so that it is straightforward to recreate the
results of the experiments once you have set up the required
environment.  To recompile the code in this document and re-run the
experiments you need to install Julia (at least version 0.3, but
preferably version 0.4) as well as Emacs with Org-Mode and ESS
(Emacs Speaks Statistics).  If you lack parts of this setup you will
still be able to read the pre-generated output (in TeX and HTML
format), and you can run the extracted Julia code on data you
provide to a stand-alone Julia implementation, but it will be more
difficult to recreate the results contained in this file.
</p>

<p>
To evaluate all code in this file evaluate
<code>org-babel-execute-buffer</code> in Emacs (i.e., open the file in an
instance of Emacs in which the prerequisites mentioned in the
previous paragraph are installed, and enter <code>M-x
  org-babel-execute-buffer</code>; a shortcut is <code>C-c C-v b</code>).  Wait a
while, and the results in the buffer will be updated with the
results of executing the examples on your machine.
</p>

<p>
We add a warning (not shown in the typeset output) at the beginning
of the generated file <code>ExtendedBehaviorTrees.jl</code>, so that people
don't accidentally edit the generated source.
</p>

<p>
The whole file is in the <code>ExtendedBehaviorTrees</code> module; the <code>end</code>
for this module declaration is at the end of the file.  We disable
evaluation of the module statement inside Org-Mode since it causes
the Julia process to hang.
</p>

<div class="org-src-container">

<pre class="src src-julia">module ExtendedBehaviorTrees
</pre>
</div>
</div>
</div>



<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Behavior Trees and Extended Behavior Trees</h2>
<div class="outline-text-2" id="text-2">
<p>
Behavior Trees (BTs) are a flexible approach for behavioral
modeling.  BTs were originally introduced to model the AI of
computer games, and they have recently been become more popular in
areas such as robotics or avionics.  BTs compose atomic behaviors
(that should correspond to more or less simple actions an agent can
take) using operations such as sequence (execute multiple behaviors
one after the other) or choice (pick among behaviors until one
succeeds).  We sometimes call behaviors <i>actions</i> or <i>tasks</i>.  One
of the advantages of BTs is that the interface between a task and
its subtasks is very simple:
</p>

<ul class="org-ul">
<li>Each task can be started; once started it runs until it returns
control to its parent.  Because of the root in game engines, this
behavior is often called <i>ticking</i>, and the corresponding function
is <code>tick</code>.  Scheduling is cooperative; behaviors have to return
after taking a small amount of time if the BT is integrated into a
frequently executing control loop.
</li>

<li>A behavior can return one of three status indications: it has
succeeded, it has failed, or it is still running.  This last
status allows BTs to integrate long-running behaviors in an event
loop.
</li>
</ul>
</div>
