src/ExtendedBehaviorTrees.tex
% Created 2014-12-04 Do 08:36
\documentclass[a4wide]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{fixltx2e}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{float}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{marvosym}
\usepackage{wasysym}
\usepackage{amssymb}
\usepackage{hyperref}
\tolerance=1000
\usepackage{a4wide}
\parindent 0pt
\parskip 0.5ex
\author{Matthias Hölzl}
\date{\today}
\title{Extended Behavior Trees}
\hypersetup{
  pdfkeywords={},
  pdfsubject={},
  pdfcreator={Emacs 24.4.1 (Org mode 8.2.10)}}
\begin{document}

\maketitle
\tableofcontents


\section{About this document}
\label{sec-1}

The source of this document is an Org-Mode file that contains text,
Julia source code and some additional data such as spreadsheets or
tables with the results of experiments.  This file is completely
self-contained, so that it is straightforward to recreate the
results of the experiments once you have set up the required
environment.  To recompile the code in this document and re-run the
experiments you need to install Julia 0.4 as well as Emacs with
Org-Mode and ESS (Emacs Speaks Statistics).  If you lack parts of
this setup you will still be able to read the pre-generated output
(in \TeX{} and HTML format), and you can run the extracted Julia code
on data you provide to a stand-alone Julia implementation, but it
will be more difficult to recreate the results.

To evaluate all code in this file evaluate
\verb~org-babel-execute-buffer~ in Emacs (i.e., open the file in an
instance of Emacs in which the prerequisites mentioned in the
previous paragraph are installed, and enter \verb~M-x   org-babel-execute-buffer~).  Wait a while, and the results in the
buffer will be updated with the results of executing the examples on
your machine.

We add a warning (not shown in the typeset output) at the beginning
of the generated file \verb~ExtendedBehaviorTrees.jl~, so that people
don't accidentally edit the generated source.

The whole file is in the \verb~ExtendedBehaviorTrees~ module; the \verb~end~
for this module declaration is at the end of the file.  We disable
evaluation of the module statement inside Org-Mode since it causes
the Julia process to hang.  (Module disabled for now to simplify
reloading the code during development.)

\begin{verbatim}
module ExtendedBehaviorTrees
\end{verbatim}



\section{Behavior Trees and Extended Behavior Trees}
\label{sec-2}

Behavior Trees (BTs) are a flexible approach for behavioral
modeling.  BTs were originally introduced to model the AI of
computer games, and they have recently been become more popular in
areas such as robotics or avionics.  BTs compose atomic behaviors
(that should correspond to more or less simple actions an agent can
take) using operations such as sequence (execute multiple behaviors
one after the other) or choice (pick among behaviors until one
succeeds).  We sometimes call behaviors \emph{actions} or \emph{tasks}.  One
of the advantages of BTs is that the interface between a task and
its subtasks is very simple:

\begin{itemize}
\item Each task can be started; once started it runs until it returns
control to its parent.  Because of the root in game engines, this
behavior is often called \emph{ticking}, and the corresponding function
is \verb~tick~.  Scheduling is cooperative; behaviors have to return
after taking a small amount of time if the BT is integrated into a
frequently executing control loop.

\item A behavior can return one of three status indications: it
succeeded, it failed, or it is still running.  This last status
allows BTs to integrate long-running behaviors in an event loop.
\end{itemize}
