src/ExtendedBehaviorTrees.org
** Extended Behavior Trees

   /Extended behavior trees (XBTs)/ are an extension of behavior trees
   that support various kinds of reasoning and learning beyond the
   reactive planning of BTs.  To this end, XBTs have a slightly more
   complicated interface between parent task and subtasks:

   - The ~tick~ function is called with a /state/ parameter and still
     returns three status indications.  However, when a task of an XBT
     succeeds it passes back a measure of the quality of the solution
     that it has achieved, and an indication whether it could continue
     running to improve this solution.

   - All effects caused in the world have to be mediated by the state
     passed in as argument.

   - The state can be /virtualized/: Conceptually normal BTs operate
     directly on the ``real world'' so that actions triggered by the
     BT immediately affect the environment in which the agent running
     the BT operates.  A virtual state decouples the actions of the BT
     temporarily from the rest of the system, so that the agent can,
     e.g., plan its future course of actions by observing the effects
     various behaviors have on the world.

** Notes about the implementation

   The implementation is not an exact clone of the SCEL semantics:

   - There are two major strategies for implementing the evaluation of
     the BT: 

     - Regard the XBT instance as the description of the tree and
       store all information for the evaluation in an external
       environment. 
     - Have a description layer above the classes that implement the
       BT and store the data required for evaluating the tree directly
       inside the nodes.

     The first alternative is closer to the SCEL semantics, but the
     second one seems slightly cleaner from a programming
     perspective.

   - There is no reason why cloning the state should require a call to
     an external service except that knowledge repositories are not a
     first class concept in SCEL.  So here we simply expect the state
     to implement a ~xbtclone~ method.

   The possibility of improving results has interesting consequences:
   what should happen if a node claims that it can improve its result
   and then the improvement fails?  For now we require that a node
   that returns /succeeded/ with an indication that it may improve
   upon the current result may never fail afterward; if it cannot
   produce a better result it has to return its previous result and
   indicate that this may no longer be improved.

* Implementation of the basic function

  In this section we set up the basics for XBTs: the results nodes may
  return when ticking, the execution states of a node, and finally the
  class structure of the node graph and the ~tick~ function.

** Execution status of nodes

   Each node can be in one of four execution states: /inactive/,
   /running/, /succeeded/, or /failed/.  To avoid confusion with the
   state passed to the ~tick~ function we cal this execution status of
   a node its /status/.  A node that has not yet been ticked has the
   /inactive/ status.  Once it starts execution it transitions into the
   /running/ status; when it returns a result or fails it moves into
   either the /succeeded/ or /failed/ status.  In the /succeeded/
   status we keep track of the value the node achieved.

   #+Begin_SRC julia
     export XbtNodeStatus, Inactive, Running, Succeeded, Failed;

     abstract XbtNodeStatus;
     immutable Inactive <: XbtNodeStatus end;
     immutable Running <: XbtNodeStatus end;
     immutable Succeeded <: XbtNodeStatus
         value
     end;
     immutable Failed <: XbtNodeStatus end;
   #+END_SRC

   We define predicates to test which status value we have.

   #+BEGIN_SRC julia
     export isinactive, isrunning, issucceeded, isfailed;

     isinactive(x) = false;
     isinactive(x::Inactive) = true;

     isrunning(x) = false;
     isrunning(x::Running) = true;

     issucceeded(x) = false;
     issucceeded(x::Succeeded) = true;

     isfailed(x) = false;
     isfailed(x::Failed) = true;
   #+END_SRC

