src/ExtendedBehaviorTrees.html

<div id="outline-container-sec-2-1" class="outline-3">
<h3 id="sec-2-1"><span class="section-number-3">2.1</span> Extended Behavior Trees</h3>
<div class="outline-text-3" id="text-2-1">
<p>
<i>Extended behavior trees (XBTs)</i> are an extension of behavior trees
that support various kinds of reasoning and learning beyond the
reactive planning of BTs.  To this end, XBTs have a slightly more
complicated interface between parent task and subtasks:
</p>

<ul class="org-ul">
<li>The <code>tick</code> function is called with a <i>state</i> parameter and still
returns three status indications.  However, when a task of an XBT
succeeds it passes back a measure of the quality of the solution
that it has achieved, and an indication whether and how it could
continue running to improve this solution.
</li>

<li>All effects caused in the world have to be mediated by the state
passed in as argument.  That is, any function <code>f</code> that has an
observable side effect should have a signature of the form
<code>f(state, args...)</code>.
</li>

<li>The state can be <i>virtualized</i>: Conceptually normal BTs operate
directly on the ``real world'' so that actions triggered by the
BT immediately affect the environment in which the agent running
the BT operates.  A virtual state decouples the actions of the BT
temporarily from the rest of the system, so that the agent can,
e.g., plan its future course of actions by observing the effects
various behaviors have on the world.
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-2-2" class="outline-3">
<h3 id="sec-2-2"><span class="section-number-3">2.2</span> Notes about the implementation</h3>
<div class="outline-text-3" id="text-2-2">
<p>
The implementation is not an exact clone of the SCEL semantics:
</p>

<ul class="org-ul">
<li>Cloning the state is not performed by an external service; this
is necessary in the semantics since knowledge repositories are
not a first class concept in SCEL.  In this implementation we
expect the state to implement a <code>xbtclone</code> method.

<div class="org-src-container">

<pre class="src src-julia">devirtualized_states = Dict();
function virtualize(state)
  res = deepcopy(state)
  res
end;
</pre>
</div>

<ul class="org-ul">
<li>Regard the XBT instance as the description of the tree and
store all information for the evaluation in an external
environment. 
</li>

<li>Have a description layer above the classes that implement the
BT and store the data required for evaluating the tree directly
inside the nodes.

<p>
The first alternative is closer to the SCEL semantics, but the
second one seems slightly cleaner from a programming
perspective.
</p>
</li>
</ul>
</li>

<li>There are two major strategies for implementing the evaluation of
the BT: 
</li>
</ul>


<p>
The possibility of improving results has interesting consequences:
what should happen if a node claims that it can improve its result
and then the improvement fails?  For now we require that a node
that returns <i>succeeded</i> with an indication that it may improve
upon the current result may never fail afterward; if it cannot
produce a better result it has to return its previous result and
indicate that this may no longer be improved.
</p>
</div>
</div>
</div>

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> Implementation of the basic function</h2>
<div class="outline-text-2" id="text-3">
<p>
In this section we set up the basics for XBTs: the results nodes may
return when ticking, the execution states of a node, and finally the
class structure of the node graph and the <code>tick</code> function.
</p>
</div>

<div id="outline-container-sec-3-1" class="outline-3">
<h3 id="sec-3-1"><span class="section-number-3">3.1</span> Execution status of nodes</h3>
<div class="outline-text-3" id="text-3-1">
<p>
Each node can be in one of four execution states: <i>inactive</i>,
<i>running</i>, <i>succeeded</i>, or <i>failed</i>.  To avoid confusion with the
state passed to the <code>tick</code> function we cal this execution status of
a node its <i>status</i>.  A node that has not yet been ticked has the
<i>inactive</i> status.  Once it starts execution it transitions into the
<i>running</i> status; when it returns a result or fails it moves into
either the <i>succeeded</i> or <i>failed</i> status.  In the <i>succeeded</i>
status we keep track of the value the node achieved.
</p>

<div class="org-src-container">

<pre class="src src-julia">export XbtNodeStatus, Inactive, Running, Succeeded, Failed;

abstract XbtNodeStatus;
immutable Inactive &lt;: XbtNodeStatus end;
immutable Running &lt;: XbtNodeStatus end;
immutable Succeeded &lt;: XbtNodeStatus
    value
end;
immutable Failed &lt;: XbtNodeStatus end;
</pre>
</div>

<p>
We define predicates to test which status value we have.
</p>

<div class="org-src-container">

<pre class="src src-julia">export isinactive, isrunning, issucceeded, isfailed;

isinactive(x) = false;
isinactive(x::Inactive) = true;

isrunning(x) = false;
isrunning(x::Running) = true;

issucceeded(x) = false;
issucceeded(x::Succeeded) = true;

isfailed(x) = false;
isfailed(x::Failed) = true;
</pre>
</div>
</div>
</div>
