src/ExtendedBehaviorTrees.tex

\subsection{Extended Behavior Trees}
\label{sec-2-1}

\emph{Extended behavior trees (XBTs)} are an extension of behavior trees
that support various kinds of reasoning and learning beyond the
reactive planning of BTs.  To this end, XBTs have a slightly more
complicated interface between parent task and subtasks:

\begin{itemize}
\item The \verb~tick~ function is called with a \emph{state} parameter and still
returns three status indications.  However, when a task of an XBT
succeeds it passes back a measure of the quality of the solution
that it has achieved, and an indication whether it could continue
running to improve this solution.

\item All effects caused in the world have to be mediated by the state
passed in as argument.

\item The state can be \emph{virtualized}: Conceptually normal BTs operate
directly on the ``real world'' so that actions triggered by the
BT immediately affect the environment in which the agent running
the BT operates.  A virtual state decouples the actions of the BT
temporarily from the rest of the system, so that the agent can,
e.g., plan its future course of actions by observing the effects
various behaviors have on the world.
\end{itemize}

\subsection{Notes about the implementation}
\label{sec-2-2}

The implementation is not an exact clone of the SCEL semantics:

\begin{itemize}
\item There are two major strategies for implementing the evaluation of
the BT: 

\begin{itemize}
\item Regard the XBT instance as the description of the tree and
store all information for the evaluation in an external
environment.
\item Have a description layer above the classes that implement the
BT and store the data required for evaluating the tree directly
inside the nodes.
\end{itemize}
The first alternative is closer to the SCEL semantics, but the
second one seems slightly cleaner from a programming
perspective.

\item There is no reason why cloning the state should require a call to
an external service except that knowledge repositories are not a
first class concept in SCEL.  So here we simply expect the state
to implement a \verb~xbtclone~ method.
\end{itemize}

The possibility of improving results has interesting consequences:
what should happen if a node claims that it can improve its result
and then the improvement fails?  For now we require that a node
that returns \emph{succeeded} with an indication that it may improve
upon the current result may never fail afterward; if it cannot
produce a better result it has to return its previous result and
indicate that this may no longer be improved.

\section{Implementation of the basic function}
\label{sec-3}

In this section we set up the basics for XBTs: the results nodes may
return when ticking, the execution states of a node, and finally the
class structure of the node graph and the \verb~tick~ function.

\subsection{Execution status of nodes}
\label{sec-3-1}

Each node can be in one of four execution states: \emph{inactive},
\emph{running}, \emph{succeeded}, or \emph{failed}.  To avoid confusion with the
state passed to the \verb~tick~ function we cal this execution status of
a node its \emph{status}.  A node that has not yet been ticked has the
\emph{inactive} status.  Once it starts execution it transitions into the
\emph{running} status; when it returns a result or fails it moves into
either the \emph{succeeded} or \emph{failed} status.  In the \emph{succeeded}
status we keep track of the value the node achieved.

\begin{verbatim}
export XbtNodeStatus, Inactive, Running, Succeeded, Failed;

abstract XbtNodeStatus;
immutable Inactive <: XbtNodeStatus end;
immutable Running <: XbtNodeStatus end;
immutable Succeeded <: XbtNodeStatus
    value
end;
immutable Failed <: XbtNodeStatus end;
\end{verbatim}

We define predicates to test which status value we have.

\begin{verbatim}
export isinactive, isrunning, issucceeded, isfailed;

isinactive(x) = false;
isinactive(x::Inactive) = true;

isrunning(x) = false;
isrunning(x::Running) = true;

issucceeded(x) = false;
issucceeded(x::Succeeded) = true;

isfailed(x) = false;
isfailed(x::Failed) = true;
\end{verbatim}
