src/ExtendedBehaviorTrees.org
** Results of ticking nodes

   For each tick of an XBT, the nodes return either /succeeded/ (with
   a quality value), /failed/ or /running/, and an indication whether
   they can improve the result they have obtained so far.  We
   therefore return simply a tuple consisting of the status of the
   node and a Boolean value.  The status in a result may never be an
   instance of ~Inactive~; furthermore when the status is /running/, the
   second value has to be ~true~, when the status is /failed/, the
   second value has to be ~false~.

   #+BEGIN_SRC julia
     export XbtNodeResult;
     typealias XbtNodeResult (XbtNodeStatus, Bool);
   #+END_SRC

   Node results are typically used to determine whether we should
   continue executing this node or not.  To simplify this we define a
   function ~isdone~ that tells us whether we should continue after
   obtaining a certain result.  ~isdone~ can either take an XBT node
   (see definition below), an ~XbtNodeResult~, or a ~XbtNodeStatus~
   and a Boolean value as arguments.

   #+BEGIN_SRC julia
     export isdone;
     isdone(x) = false;
     isdone(x::XbtNodeResult) = isdone(x...);
     isdone(x, cont) = false;
     isdone(x::Succeeded, cont::Bool) = !cont;
     isdone(x::Failed, cont::Bool) = true;
   #+END_SRC

   We define abbreviations for commonly used return values. When a
   computation fails or wants to keep running we can simply return one
   of the constants ~failed~ or ~running~; in these cases there is no
   question whether the computation wants to continue or not, a failed
   computation never wants to continue, a running computation always
   wants to.  In the case of successful computation we have to return
   a value, and either wanting to continue or not is possible.  Since
   the former is the more likely case we make it the default.
   #+BEGIN_SRC julia
     export failed, running, succeeded;
     const failed = (Failed(), false);
     const running = (Running(), true);
     succeeded(val, cont=false) = (Succeeded(val), cont);
   #+END_SRC

** XBT Nodes

   Nodes in XBTs can either be composite (if they have children) or
   atomic.  We might parameterize the classes on the type of the value
   successful computations return, but this complicates the
   definitions and does not seem to provide many benefits (since all
   functions have type ~Function~, we cannot really use the type
   parameter in the places where it might affect performance).

   #+BEGIN_SRC julia
     export XbtNode, AtomicXbtNode, CompositeXbtNode;
     abstract XbtNode;
     abstract AtomicXbtNode <: XbtNode;
     abstract CompositeXbtNode <: XbtNode;
   #+END_SRC

   Each task has to either store its execution status in a slot
   ~status~ or provide a method on ~status~ so that we can determine
   the execution status of tasks in a generic manner.  Similarly for
   continuing with the node.

   #+BEGIN_SRC julia
     export status, setstatus;
     status(node::XbtNode) = node.status;
     setstatus(node::XbtNode, status::XbtNodeStatus) = node.status = status;

     export cont, setcont;
     cont(node::XbtNode) = node.cont;
     setcont(node::XbtNode, cont::Bool) = node.cont = cont;

     export result, setresult;
     result(node::XbtNode) = status(node), cont(node);

     function setresult(node::XbtNode, result::XbtNodeResult)
         setstatus(node, result[1])
         setcont(node, result[2])
         result
     end;

     isinactive(node::XbtNode) = isinactive(status(node));
     isrunning(node::XbtNode) = isrunning(status(node));
     issucceeded(node::XbtNode) = issucceeded(status(node));
     isfailed(node::XbtNode) = isfailed(status(node));
     isdone(node::XbtNode) = isdone(status(node), cont(node));

     export setinactive;
     function setinactive(node::XbtNode)
         setstatus(node, Inactive());
         setcont(node, true); # Slightly superfluous
     end;
   #+END_SRC

