src/ExtendedBehaviorTrees.html

<div id="outline-container-sec-3-2" class="outline-3">
<h3 id="sec-3-2"><span class="section-number-3">3.2</span> Results of ticking nodes</h3>
<div class="outline-text-3" id="text-3-2">
<p>
For each tick of an XBT, the nodes return either <i>succeeded</i> (with
a quality value), <i>failed</i> or <i>running</i>, and an indication whether
they can improve the result they have obtained so far.  We
therefore return simply a tuple consisting of the status of the
node and a Boolean value.  The status in a result may never be an
instance of <code>Inactive</code>; furthermore when the status is <i>running</i>, the
second value has to be <code>true</code>, when the status is <i>failed</i>, the
second value has to be <code>false</code>.
</p>

<div class="org-src-container">

<pre class="src src-julia">export XbtNodeResult;
typealias XbtNodeResult (XbtNodeStatus, Bool);
</pre>
</div>

<p>
Node results are typically used to determine whether we should
continue executing this node or not.  To simplify this we define a
function <code>isdone</code> that tells us whether we should continue after
obtaining a certain result.  <code>isdone</code> can either take an XBT node
(see definition below), an <code>XbtNodeResult</code>, or a <code>XbtNodeStatus</code>
and a Boolean value as arguments.
</p>

<div class="org-src-container">

<pre class="src src-julia">export isdone;
isdone(x) = false;
isdone(x::XbtNodeResult) = isdone(x...);
isdone(x, cont) = false;
isdone(x::Succeeded, cont::Bool) = !cont;
isdone(x::Failed, cont::Bool) = true;
</pre>
</div>

<p>
We define abbreviations for commonly used return values. When a
computation fails or wants to keep running we can simply return one
of the constants <code>failed</code> or <code>running</code>; in these cases there is no
question whether the computation wants to continue or not, a failed
computation never wants to continue, a running computation always
wants to.  In the case of successful computation we have to return
a value, and either wanting to continue or not is possible.  Since
the former is the more likely case we make it the default.
</p>
<div class="org-src-container">

<pre class="src src-julia">export failed, running, succeeded;
const failed = (Failed(), false);
const running = (Running(), true);
succeeded(val, cont=false) = (Succeeded(val), cont);
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-3-3" class="outline-3">
<h3 id="sec-3-3"><span class="section-number-3">3.3</span> XBT Nodes</h3>
<div class="outline-text-3" id="text-3-3">
<p>
Nodes in XBTs can either be composite (if they have children) or
atomic.  We might parameterize the classes on the type of the value
successful computations return, but this complicates the
definitions and does not seem to provide many benefits (since all
functions have type <code>Function</code>, we cannot really use the type
parameter in the places where it might affect performance).
</p>

<div class="org-src-container">

<pre class="src src-julia">export XbtNode, AtomicXbtNode, CompositeXbtNode;
abstract XbtNode;
abstract AtomicXbtNode &lt;: XbtNode;
abstract CompositeXbtNode &lt;: XbtNode;
</pre>
</div>

<p>
Each task has to either store its execution status in a slot
<code>status</code> or provide a method on <code>status</code> so that we can determine
the execution status of tasks in a generic manner.  Similarly for
continuing with the node.
</p>

<div class="org-src-container">

<pre class="src src-julia">export status, setstatus;
status(node::XbtNode) = node.status;
setstatus(node::XbtNode, status::XbtNodeStatus) = node.status = status;

export cont, setcont;
cont(node::XbtNode) = node.cont;
setcont(node::XbtNode, cont::Bool) = node.cont = cont;

export result, setresult;
result(node::XbtNode) = status(node), cont(node);

function setresult(node::XbtNode, result::XbtNodeResult)
    setstatus(node, result[1])
    setcont(node, result[2])
    result
end;

isinactive(node::XbtNode) = isinactive(status(node));
isrunning(node::XbtNode) = isrunning(status(node));
issucceeded(node::XbtNode) = issucceeded(status(node));
isfailed(node::XbtNode) = isfailed(status(node));
isdone(node::XbtNode) = isdone(status(node), cont(node));

export setinactive;
function setinactive(node::XbtNode)
    setstatus(node, Inactive());
    setcont(node, true); # Slightly superfluous
end;
</pre>
</div>
</div>
</div>
