src/ExtendedBehaviorTrees.org
** Atomic XBT Nodes

   We allow two kinds of atomic nodes: ~XbtTask~ and ~XbtFun~.  Tasks
   are the more general nodes that are invoked as coroutines so that
   they can suspend their computation while they are still running.
   Instances of ~XbtFun~ are simply wrappers around functions that
   succeed or fail but don't suspend.  (Maybe we should simply allow
   functions as leaves?)

   #+BEGIN_SRC julia
     type XbtTask <: AtomicXbtNode
         task::Task
         status::XbtNodeStatus
         cont::Bool
     end;

     function XbtTask(fun::Function, status::XbtNodeStatus, cont::Bool)
         XbtTask(Task(fun), status, cont);
     end;
     XbtTask(task, status) = XbtTask(task, status, false);
     XbtTask(task) = XbtTask(task, Inactive());

     function tick(node::XbtTask, state)
         if (isdone(node))
             return result(node)
         end
         setresult(node, consume(node.task))
     end;

     type XbtFun <: AtomicXbtNode
         fun::Function
         status::XbtNodeStatus
         cont::Bool
     end;

     XbtFun(fun::Function, status::XbtNodeStatus) = XbtFun(task, status, false);
     XbtFun(fun::Function) = XbtFun(fun, Inactive());

     function tick(node::XbtFun, state)
         if (isdone(node))
             return result(node)
         end
         setresult(node, node.fun())
     end;
   #+END_SRC

   The following is a task that runs for three ticks, then succeeds
   with value 1 and the possibility to continue.  When ticked after
   succeeding for the first time it will continue to run for two more
   ticks and then succeed with value 10 without being able to improve.
   After that it will continue to succeed with value 10 until it is
   reset to its initial state.

   #+BEGIN_SRC julia :tangle no
      function tick_and_print(node, n)
          for i=1:n
              println(tick(node, ()))
          end
      end;

     function f1()
         for i=1:3
             produce(running)
         end
         produce(succeeded(1, true))
         produce(running)
         produce(running)
         produce(succeeded(10))
     end;
     task1 = XbtTask(f1);
   #+END_SRC

   When ticking this tree for 8 iterations we obtain the following
   result:

   #+BEGIN_SRC julia :tangle no :results output replace :exports results
     tick_and_print(task1, 8);
   #+END_SRC

   #+RESULTS:
   : (Running(),true)
   : (Running(),true)
   : (Running(),true)
   : (Succeeded(1),true)
   : (Running(),true)
   : (Running(),true)
   : (Succeeded(10),false)
   : (Succeeded(10),false)

** Composite XBT Nodes

   The simplest kinds of composite XBT nodes are sequences and
   choices.  A Sequence executes its child nodes sequentially until a
   child node fails.  In that case the sequence node fails as well.
   If all child nodes succeed the sequence node succeeds.  Choice
   nodes work in the reverse manner: They execute their children in
   turn until the first child succeeds in which case the choice
   succeeds.  If all children fail the choice fails.  Since we will
   later have several nodes that are sequence- or choice-like we
   define abstract types for these two behaviors.  We also define
   the following functions

   - ~children~ returns a sequence of children of an XBT node.  We
     define a default implementation returning an empty list of
     children on ~XbtNode~.
   - ~improvechild~ returns ~true~ if the node should improve the
     specified child; ~false~ otherwise.  It is not quite clear,
     whether this is the correct interface, or whether there should be
     a more general policy that specifies how children should be
     improved (i.e., depth first, breadth first, only some children.)

   #+BEGIN_SRC julia
     abstract XbtSequenceNode <: CompositeXbtNode;
     abstract XbtChoiceNode <: CompositeXbtNode;

     children(::XbtNode) = [];
     children(node::CompositeXbtNode) = node.children;
     improvechild(node::CompositeXbtNode, child::XbtNode=(), state=()) = false;
   #+END_SRC

