src/ExtendedBehaviorTrees.html

<div id="outline-container-sec-3-4" class="outline-3">
<h3 id="sec-3-4"><span class="section-number-3">3.4</span> Atomic XBT Nodes</h3>
<div class="outline-text-3" id="text-3-4">
<p>
We allow two kinds of atomic nodes: <code>XbtTask</code> and <code>XbtFun</code>.  Tasks
are the more general nodes that are invoked as coroutines so that
they can suspend their computation while they are still running.
Instances of <code>XbtFun</code> are simply wrappers around functions that
succeed or fail but don't suspend.  (Maybe we should simply allow
functions as leaves?)
</p>

<div class="org-src-container">

<pre class="src src-julia">type XbtTask &lt;: AtomicXbtNode
    task::Task
    status::XbtNodeStatus
    cont::Bool
end;

function XbtTask(fun::Function, status::XbtNodeStatus, cont::Bool)
    XbtTask(Task(fun), status, cont);
end;
XbtTask(task, status) = XbtTask(task, status, false);
XbtTask(task) = XbtTask(task, Inactive());

function tick(node::XbtTask, state)
    if (isdone(node))
        return result(node)
    end
    setresult(node, consume(node.task))
end;

type XbtFun &lt;: AtomicXbtNode
    fun::Function
    status::XbtNodeStatus
    cont::Bool
end;

XbtFun(fun::Function, status::XbtNodeStatus) = XbtFun(task, status, false);
XbtFun(fun::Function) = XbtFun(fun, Inactive());

function tick(node::XbtFun, state)
    if (isdone(node))
        return result(node)
    end
    setresult(node, node.fun())
end;
</pre>
</div>

<p>
The following is a task that runs for three ticks, then succeeds
with value 1 and the possibility to continue.  When ticked after
succeeding for the first time it will continue to run for two more
ticks and then succeed with value 10 without being able to improve.
After that it will continue to succeed with value 10 until it is
reset to its initial state.
</p>

<div class="org-src-container">

<pre class="src src-julia"> function tick_and_print(node, n)
     for i=1:n
         println(tick(node, ()))
     end
 end;

function f1()
    for i=1:3
        produce(running)
    end
    produce(succeeded(1, true))
    produce(running)
    produce(running)
    produce(succeeded(10))
end;
task1 = XbtTask(f1);
</pre>
</div>

<p>
When ticking this tree for 8 iterations we obtain the following
result:
</p>

<pre class="example">
(Running(),true)
(Running(),true)
(Running(),true)
(Succeeded(1),true)
(Running(),true)
(Running(),true)
(Succeeded(10),false)
(Succeeded(10),false)
</pre>
</div>
</div>

<div id="outline-container-sec-3-5" class="outline-3">
<h3 id="sec-3-5"><span class="section-number-3">3.5</span> Composite XBT Nodes</h3>
<div class="outline-text-3" id="text-3-5">
<p>
The simplest kinds of composite XBT nodes are sequences and
choices.  A Sequence executes its child nodes sequentially until a
child node fails.  In that case the sequence node fails as well.
If all child nodes succeed the sequence node succeeds.  Choice
nodes work in the reverse manner: They execute their children in
turn until the first child succeeds in which case the choice
succeeds.  If all children fail the choice fails.  Since we will
later have several nodes that are sequence- or choice-like we
define abstract types for these two behaviors.  We also define
the following functions
</p>

<ul class="org-ul">
<li><code>children</code> returns a sequence of children of an XBT node.  We
define a default implementation returning an empty list of
children on <code>XbtNode</code>.
</li>
<li><code>improvechild</code> returns <code>true</code> if the node should improve the
specified child; <code>false</code> otherwise.  It is not quite clear,
whether this is the correct interface, or whether there should be
a more general policy that specifies how children should be
improved (i.e., depth first, breadth first, only some children.)
</li>
</ul>

<div class="org-src-container">

<pre class="src src-julia">abstract XbtSequenceNode &lt;: CompositeXbtNode;
abstract XbtChoiceNode &lt;: CompositeXbtNode;

children(::XbtNode) = [];
children(node::CompositeXbtNode) = node.children;
improvechild(node::CompositeXbtNode, child::XbtNode=(), state=()) = false;
</pre>
</div>
</div>
