src/ExtendedBehaviorTrees.org
*** Sequence nodes

    We define a generic implementation of tick for sequence nodes.
    We might have to introduce some generic functions to make it
    simpler to override parts of its behavior; this remains to be seen
    once we actually define specialized sequence nodes.  Currently
    sequence nodes improve their children immediately if they do so at
    all; this should be changed so that iterative improvements are
    possible (i.e., return first a solution after computing only
    unimproved values, then improve some values, etc.).

    #+BEGIN_SRC julia
      function tick(node::XbtSequenceNode, state)
          if (isdone(node))
              return result(node)
          end
          local sum = 0, status, cont;
          for child in children(node)
              status, cont = tick(child, state)
              if isfailed(status)
                  return setresult(node, failed)
              end;
              if isrunning(status)
                  return setresult(node, running)
              end;
              # We have succeeded; improve the child result if necessary.
              while (improvechild(node, child) && cont)
                  println("Improving")
                  status, cont = @show tick(child, state)
              end
              assert(isa(status, Succeeded))
              # Ensure that future activations don't try to improve the
              # child again
              setcont(child, false)
              sum += status.value
          end;
          setresult(node, succeeded(sum));
      end;

      type XbtSeq <: XbtSequenceNode
          children::AbstractArray{XbtNode,1}
          status::XbtNodeStatus
          cont::Bool
      end;

      function XbtSeq(children::AbstractArray{Any,1},
                      status::XbtNodeStatus,
                      cont::Bool)
          XbtSeq(XbtNode[children...], status, cont)
      end;

      function XbtSeq(children, status=Inactive())
          XbtSeq(children, status, false)
      end;
    #+END_SRC

    Here are some examples of sequence nodes that succeed. We run them
    until the results can no longer be improved (which is the first
    time the node succeeds).

    #+BEGIN_SRC julia :tangle no :exports code
      function f2()
          produce(running)
          produce(running)
          produce(succeeded(1, true))
          produce(running)
          produce(succeeded(10))
      end;

      task2 = XbtSeq([XbtTask(()->succeeded(10)), XbtTask(f2)]);
    #+END_SRC

    #+BEGIN_SRC julia :tangle no :results output replace :exports results
      tick_and_print(task2, 4);
    #+END_SRC

    #+RESULTS:
    : (Running(),true)
    : (Running(),true)
    : (Succeeded(11),false)
    : (Succeeded(11),false)

    #+BEGIN_SRC julia :tangle no :exports code
      task3 = XbtSeq([XbtTask(f2), XbtTask(()->succeeded(10))]);
    #+END_SRC

    #+BEGIN_SRC julia :tangle no :results output replace :exports results
      tick_and_print(task3, 4);
    #+END_SRC

    #+RESULTS:
    : (Running(),true)
    : (Running(),true)
    : (Succeeded(11),false)
    : (Succeeded(11),false)

    #+BEGIN_SRC julia :tangle no :exports code
      task4 = XbtSeq([XbtTask(f2), XbtTask(f2)]);
    #+END_SRC

    #+BEGIN_SRC julia :tangle no :results output replace :exports results
      tick_and_print(task4, 6);
    #+END_SRC

    #+RESULTS:
    : (Running(),true)
    : (Running(),true)
    : (Running(),true)
    : (Running(),true)
    : (Succeeded(2),false)
    : (Succeeded(2),false)

    And in the following examples the sequence nodes fail:

    #+BEGIN_SRC julia :tangle no
      task5 = XbtSeq([XbtTask(()->failed), XbtTask(f2)]);
    #+END_SRC

    #+BEGIN_SRC julia :tangle no :results output replace :exports results
      tick_and_print(task5, 2);
    #+END_SRC

    #+RESULTS:
    : (Failed(),false)
    : (Failed(),false)

    #+BEGIN_SRC julia :tangle no 
      task6 = XbtSeq([XbtTask(f2), XbtTask(()->failed)]);
    #+END_SRC
    #+BEGIN_SRC julia :tangle no :results output replace :exports results
      tick_and_print(task6, 4)
    #+END_SRC

    #+RESULTS:
    : (Running(),true)
    : (Running(),true)
    : (Failed(),false)
    : (Failed(),false)

