src/ExtendedBehaviorTrees.html

<div id="outline-container-sec-3-5-1" class="outline-4">
<h4 id="sec-3-5-1"><span class="section-number-4">3.5.1</span> Sequence nodes</h4>
<div class="outline-text-4" id="text-3-5-1">
<p>
We define a generic implementation of tick for sequence nodes.
We might have to introduce some generic functions to make it
simpler to override parts of its behavior; this remains to be seen
once we actually define specialized sequence nodes.  Currently
sequence nodes improve their children immediately if they do so at
all; this should be changed so that iterative improvements are
possible (i.e., return first a solution after computing only
unimproved values, then improve some values, etc.).
</p>

<div class="org-src-container">

<pre class="src src-julia">function tick(node::XbtSequenceNode, state)
    if (isdone(node))
        return result(node)
    end
    local sum = 0, status, cont;
    for child in children(node)
        status, cont = tick(child, state)
        if isfailed(status)
            return setresult(node, failed)
        end;
        if isrunning(status)
            return setresult(node, running)
        end;
        # We have succeeded; improve the child result if necessary.
        while (improvechild(node, child) &amp;&amp; cont)
            println("Improving")
            status, cont = @show tick(child, state)
        end
        assert(isa(status, Succeeded))
        # Ensure that future activations don't try to improve the
        # child again
        setcont(child, false)
        sum += status.value
    end;
    setresult(node, succeeded(sum));
end;

type XbtSeq &lt;: XbtSequenceNode
    children::AbstractArray{XbtNode,1}
    status::XbtNodeStatus
    cont::Bool
end;

function XbtSeq(children::AbstractArray{Any,1},
                status::XbtNodeStatus,
                cont::Bool)
    XbtSeq(XbtNode[children...], status, cont)
end;

function XbtSeq(children, status=Inactive())
    XbtSeq(children, status, false)
end;
</pre>
</div>

<p>
Here are some examples of sequence nodes that succeed. We run them
until the results can no longer be improved (which is the first
time the node succeeds).
</p>

<div class="org-src-container">

<pre class="src src-julia">function f2()
    produce(running)
    produce(running)
    produce(succeeded(1, true))
    produce(running)
    produce(succeeded(10))
end;

task2 = XbtSeq([XbtTask(()-&gt;succeeded(10)), XbtTask(f2)]);
</pre>
</div>

<pre class="example">
(Running(),true)
(Running(),true)
(Succeeded(11),false)
(Succeeded(11),false)
</pre>

<div class="org-src-container">

<pre class="src src-julia">task3 = XbtSeq([XbtTask(f2), XbtTask(()-&gt;succeeded(10))]);
</pre>
</div>

<pre class="example">
(Running(),true)
(Running(),true)
(Succeeded(11),false)
(Succeeded(11),false)
</pre>

<div class="org-src-container">

<pre class="src src-julia">task4 = XbtSeq([XbtTask(f2), XbtTask(f2)]);
</pre>
</div>

<pre class="example">
(Running(),true)
(Running(),true)
(Running(),true)
(Running(),true)
(Succeeded(2),false)
(Succeeded(2),false)
</pre>

<p>
And in the following examples the sequence nodes fail:
</p>

<div class="org-src-container">

<pre class="src src-julia">task5 = XbtSeq([XbtTask(()-&gt;failed), XbtTask(f2)]);
</pre>
</div>

<pre class="example">
(Failed(),false)
(Failed(),false)
</pre>

<div class="org-src-container">

<pre class="src src-julia">task6 = XbtSeq([XbtTask(f2), XbtTask(()-&gt;failed)]);
</pre>
</div>
<pre class="example">
(Running(),true)
(Running(),true)
(Failed(),false)
(Failed(),false)
</pre>
</div>
</div>
