src/ExtendedBehaviorTrees.tex

\subsubsection{Sequence nodes}
\label{sec-3-5-1}

We define a generic implementation of tick for sequence nodes.
We might have to introduce some generic functions to make it
simpler to override parts of its behavior; this remains to be seen
once we actually define specialized sequence nodes.  Currently
sequence nodes improve their children immediately if they do so at
all; this should be changed so that iterative improvements are
possible (i.e., return first a solution after computing only
unimproved values, then improve some values, etc.).

\begin{verbatim}
function tick(node::XbtSequenceNode, state)
    if (isdone(node))
        return result(node)
    end
    local sum = 0, status, cont;
    for child in children(node)
        status, cont = tick(child, state)
        if isfailed(status)
            return setresult(node, failed)
        end;
        if isrunning(status)
            return setresult(node, running)
        end;
        # We have succeeded; improve the child result if necessary.
        while (improvechild(node, child) && cont)
            println("Improving")
            status, cont = @show tick(child, state)
        end
        assert(isa(status, Succeeded))
        # Ensure that future activations don't try to improve the
        # child again
        setcont(child, false)
        sum += status.value
    end;
    setresult(node, succeeded(sum));
end;

type XbtSeq <: XbtSequenceNode
    children::AbstractArray{XbtNode,1}
    status::XbtNodeStatus
    cont::Bool
end;

function XbtSeq(children::AbstractArray{Any,1},
                status::XbtNodeStatus,
                cont::Bool)
    XbtSeq(XbtNode[children...], status, cont)
end;

function XbtSeq(children, status=Inactive())
    XbtSeq(children, status, false)
end;
\end{verbatim}

Here are some examples of sequence nodes that succeed. We run them
until the results can no longer be improved (which is the first
time the node succeeds).

\begin{verbatim}
function f2()
    produce(running)
    produce(running)
    produce(succeeded(1, true))
    produce(running)
    produce(succeeded(10))
end;

task2 = XbtSeq([XbtTask(()->succeeded(10)), XbtTask(f2)]);
\end{verbatim}

\begin{verbatim}
(Running(),true)
(Running(),true)
(Succeeded(11),false)
(Succeeded(11),false)
\end{verbatim}

\begin{verbatim}
task3 = XbtSeq([XbtTask(f2), XbtTask(()->succeeded(10))]);
\end{verbatim}

\begin{verbatim}
(Running(),true)
(Running(),true)
(Succeeded(11),false)
(Succeeded(11),false)
\end{verbatim}

\begin{verbatim}
task4 = XbtSeq([XbtTask(f2), XbtTask(f2)]);
\end{verbatim}

\begin{verbatim}
(Running(),true)
(Running(),true)
(Running(),true)
(Running(),true)
(Succeeded(2),false)
(Succeeded(2),false)
\end{verbatim}

And in the following examples the sequence nodes fail:

\begin{verbatim}
task5 = XbtSeq([XbtTask(()->failed), XbtTask(f2)]);
\end{verbatim}

\begin{verbatim}
(Failed(),false)
(Failed(),false)
\end{verbatim}

\begin{verbatim}
task6 = XbtSeq([XbtTask(f2), XbtTask(()->failed)]);
\end{verbatim}
\begin{verbatim}
(Running(),true)
(Running(),true)
(Failed(),false)
(Failed(),false)
\end{verbatim}
