src/ExtendedBehaviorTrees.org
*** Choice nodes

    Choice nodes are implemented in a manner similar to sequence
    nodes, with failure and success swapped.

    #+BEGIN_SRC julia
      function tick(node::XbtChoiceNode, state)
          if (isdone(node))
              return result(node)
          end
          local status, cont;
          for child in children(node)
              status, cont = tick(child, state)
              if issucceeded(status)
                  # We have succeeded; improve child if necessary
                  while (improvechild(node, child) && cont)
                      status, cont = @show tick(child, state)
                  end
                  assert(isa(status, Succeeded))
                  # Ensure that future activations don't try to improve the
                  # child again
                  setcont(child, false)
                  return setresult(node, result(child))
              end;
              if isrunning(status)
                  return setresult(node, running)
              end;
          end;
          setresult(node, failed);
      end;

      type XbtChoice <: XbtChoiceNode
          children::AbstractArray{XbtNode,1}
          status::XbtNodeStatus
          cont::Bool
      end;

      function XbtChoice(children::AbstractArray{Any,1},
                         status::XbtNodeStatus,
                         cont::Bool)
          XbtChoice(XbtNode[children...], status, cont)
      end;

      function XbtChoice(children, status=Inactive())
          XbtChoice(children, status, false)
      end;
    #+END_SRC

    Again, we have examples of choice nodes that succeed:

    #+BEGIN_SRC julia :tangle no
      task7 = XbtChoice([XbtTask(()->succeeded(10)), XbtTask(f2)]);
    #+END_SRC

    #+BEGIN_SRC julia :tangle no :results output replace :exports results
      tick_and_print(task7, 2);
    #+END_SRC

    #+RESULTS:
    : (Succeeded(10),false)
    : (Succeeded(10),false)

    #+BEGIN_SRC julia :tangle no
      task8 = XbtChoice([XbtTask(f2), XbtTask(()->succeeded(10))]);
    #+END_SRC

    #+BEGIN_SRC julia :tangle no :results output replace :exports results
      tick_and_print(task8, 4);
    #+END_SRC

    #+RESULTS:
    : (Running(),true)
    : (Running(),true)
    : (Succeeded(1),false)
    : (Succeeded(1),false)

    #+BEGIN_SRC julia :tangle no
      task9 = XbtChoice([XbtTask(f2), XbtTask(f2)]);
    #+END_SRC

    #+BEGIN_SRC julia :tangle no :results output replace :exports results
      tick_and_print(task9, 4);
    #+END_SRC

    #+RESULTS:
    : (Running(),true)
    : (Running(),true)
    : (Succeeded(1),false)
    : (Succeeded(1),false)

    And in the following examples the choice nodes fail:

    #+BEGIN_SRC julia :tangle no
      task10 = XbtChoice([XbtTask(()->failed), XbtTask(f2)]);
    #+END_SRC

    #+BEGIN_SRC julia :tangle no :results output replace :exports results
      tick_and_print(task10, 4);
    #+END_SRC

    #+RESULTS:
    : (Running(),true)
    : (Running(),true)
    : (Succeeded(1),false)
    : (Succeeded(1),false)

    #+BEGIN_SRC julia :tangle no
      task11 = XbtChoice([XbtTask(f2), XbtTask(()->failed)]);
    #+END_SRC

    #+BEGIN_SRC julia :tangle no :results output replace :exports results
      tick_and_print(task11, 4);
    #+END_SRC

    #+RESULTS:
    : (Running(),true)
    : (Running(),true)
    : (Succeeded(1),false)
    : (Succeeded(1),false)

* HTN Planning

** States and Goals

** The Planner

* Reinforcement Learning

#+BEGIN_SRC julia :eval never
  end; # module ExtendedBehaviorTrees
#+END_SRC
