src/ExtendedBehaviorTrees.html

<div id="outline-container-sec-3-5-2" class="outline-4">
<h4 id="sec-3-5-2"><span class="section-number-4">3.5.2</span> Choice nodes</h4>
<div class="outline-text-4" id="text-3-5-2">
<p>
Choice nodes are implemented in a manner similar to sequence
nodes, with failure and success swapped.
</p>

<div class="org-src-container">

<pre class="src src-julia">function tick(node::XbtChoiceNode, state)
    if (isdone(node))
        return result(node)
    end
    local status, cont;
    for child in children(node)
        status, cont = tick(child, state)
        if issucceeded(status)
            # We have succeeded; improve child if necessary
            while (improvechild(node, child) &amp;&amp; cont)
                status, cont = @show tick(child, state)
            end
            assert(isa(status, Succeeded))
            # Ensure that future activations don't try to improve the
            # child again
            setcont(child, false)
            return setresult(node, result(child))
        end;
        if isrunning(status)
            return setresult(node, running)
        end;
    end;
    setresult(node, failed);
end;

type XbtChoice &lt;: XbtChoiceNode
    children::AbstractArray{XbtNode,1}
    status::XbtNodeStatus
    cont::Bool
end;

function XbtChoice(children::AbstractArray{Any,1},
                   status::XbtNodeStatus,
                   cont::Bool)
    XbtChoice(XbtNode[children...], status, cont)
end;

function XbtChoice(children, status=Inactive())
    XbtChoice(children, status, false)
end;
</pre>
</div>

<p>
Again, we have examples of choice nodes that succeed:
</p>

<div class="org-src-container">

<pre class="src src-julia">task7 = XbtChoice([XbtTask(()-&gt;succeeded(10)), XbtTask(f2)]);
</pre>
</div>

<pre class="example">
(Succeeded(10),false)
(Succeeded(10),false)
</pre>

<div class="org-src-container">

<pre class="src src-julia">task8 = XbtChoice([XbtTask(f2), XbtTask(()-&gt;succeeded(10))]);
</pre>
</div>

<pre class="example">
(Running(),true)
(Running(),true)
(Succeeded(1),false)
(Succeeded(1),false)
</pre>

<div class="org-src-container">

<pre class="src src-julia">task9 = XbtChoice([XbtTask(f2), XbtTask(f2)]);
</pre>
</div>

<pre class="example">
(Running(),true)
(Running(),true)
(Succeeded(1),false)
(Succeeded(1),false)
</pre>

<p>
And in the following examples the choice nodes fail:
</p>

<div class="org-src-container">

<pre class="src src-julia">task10 = XbtChoice([XbtTask(()-&gt;failed), XbtTask(f2)]);
</pre>
</div>

<pre class="example">
(Running(),true)
(Running(),true)
(Succeeded(1),false)
(Succeeded(1),false)
</pre>

<div class="org-src-container">

<pre class="src src-julia">task11 = XbtChoice([XbtTask(f2), XbtTask(()-&gt;failed)]);
</pre>
</div>

<pre class="example">
(Running(),true)
(Running(),true)
(Succeeded(1),false)
(Succeeded(1),false)
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> HTN Planning</h2>
<div class="outline-text-2" id="text-4">
</div><div id="outline-container-sec-4-1" class="outline-3">
<h3 id="sec-4-1"><span class="section-number-3">4.1</span> States and Goals</h3>
</div>

<div id="outline-container-sec-4-2" class="outline-3">
<h3 id="sec-4-2"><span class="section-number-3">4.2</span> The Planner</h3>
</div>
</div>

<div id="outline-container-sec-5" class="outline-2">
<h2 id="sec-5"><span class="section-number-2">5</span> Reinforcement Learning</h2>
<div class="outline-text-2" id="text-5">
<div class="org-src-container">

<pre class="src src-julia">end; # module ExtendedBehaviorTrees
</pre>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Matthias Hölzl</p>
<p class="date">Created: 2014-12-04 Thu 14:21</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 24.4.1 (<a href="http://orgmode.org">Org</a> mode 8.2.10)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
