src/ExtendedBehaviorTrees.tex

\subsubsection{Choice nodes}
\label{sec-3-5-2}

Choice nodes are implemented in a manner similar to sequence
nodes, with failure and success swapped.

\begin{verbatim}
function tick(node::XbtChoiceNode, state)
    if (isdone(node))
        return result(node)
    end
    local status, cont;
    for child in children(node)
        status, cont = tick(child, state)
        if issucceeded(status)
            # We have succeeded; improve child if necessary
            while (improvechild(node, child) && cont)
                status, cont = @show tick(child, state)
            end
            assert(isa(status, Succeeded))
            # Ensure that future activations don't try to improve the
            # child again
            setcont(child, false)
            return setresult(node, result(child))
        end;
        if isrunning(status)
            return setresult(node, running)
        end;
    end;
    setresult(node, failed);
end;

type XbtChoice <: XbtChoiceNode
    children::AbstractArray{XbtNode,1}
    status::XbtNodeStatus
    cont::Bool
end;

function XbtChoice(children::AbstractArray{Any,1},
                   status::XbtNodeStatus,
                   cont::Bool)
    XbtChoice(XbtNode[children...], status, cont)
end;

function XbtChoice(children, status=Inactive())
    XbtChoice(children, status, false)
end;
\end{verbatim}

Again, we have examples of choice nodes that succeed:

\begin{verbatim}
task7 = XbtChoice([XbtTask(()->succeeded(10)), XbtTask(f2)]);
\end{verbatim}

\begin{verbatim}
(Succeeded(10),false)
(Succeeded(10),false)
\end{verbatim}

\begin{verbatim}
task8 = XbtChoice([XbtTask(f2), XbtTask(()->succeeded(10))]);
\end{verbatim}

\begin{verbatim}
(Running(),true)
(Running(),true)
(Succeeded(1),false)
(Succeeded(1),false)
\end{verbatim}

\begin{verbatim}
task9 = XbtChoice([XbtTask(f2), XbtTask(f2)]);
\end{verbatim}

\begin{verbatim}
(Running(),true)
(Running(),true)
(Succeeded(1),false)
(Succeeded(1),false)
\end{verbatim}

And in the following examples the choice nodes fail:

\begin{verbatim}
task10 = XbtChoice([XbtTask(()->failed), XbtTask(f2)]);
\end{verbatim}

\begin{verbatim}
(Running(),true)
(Running(),true)
(Succeeded(1),false)
(Succeeded(1),false)
\end{verbatim}

\begin{verbatim}
task11 = XbtChoice([XbtTask(f2), XbtTask(()->failed)]);
\end{verbatim}

\begin{verbatim}
(Running(),true)
(Running(),true)
(Succeeded(1),false)
(Succeeded(1),false)
\end{verbatim}

\section{HTN Planning}
\label{sec-4}

\subsection{States and Goals}
\label{sec-4-1}

\subsection{The Planner}
\label{sec-4-2}

\section{Reinforcement Learning}
\label{sec-5}

\begin{verbatim}
end; # module ExtendedBehaviorTrees
\end{verbatim}
% Emacs 24.4.1 (Org mode 8.2.10)
\end{document}